package by.htp.fundamentals1.main;

public class Task4 {

	public static void main(String[] args) {
		//4. Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран цифру
		//7, в противном случае – цифру 8.

		int a = 1;
		int b = 2;
		if (a < b) {
			System.out.println("7");
		} else {
			System.out.println("8");
		}

	}

}
